# ----------------나눔 연산자()/)   #나눔의 결과는 실수로나옴(float) 0.0
# print(10/2)                       # 5.0 나눔의 자료형은
# print(5.5/2.0)

# num1 = 100
# num2 = 10
# print(f'num1/num2 = {num1/num2}')





                 #  :.2f  소수점 2자리까지만 표기하는 용어

#--------- 나머지만(%)
# print(10%2)
# print(10%3)

# #quiz 홀짝 게임
# # 손 안에 동전 개수를 입력하면 짝수는 0, 홀수는 1을 출력하는 프로그램
# inputData = int(input('손 안에 동전 수를 입력하세요 '))
# result = inputData % 2
# # print(result)

# #--------- 몫(//)
# print(11//3)     # 3 정수형 자료
# print(10//2)     # 5 정수형 자료


# #--------- 거듭제곱(**)
# print(2**4) #2의 4승을 뜻함

# # quiz 전염병 예상 감염주 수 구하는법
# # 보건당국은 전염병의 감염확산 추세를 파악한 결과,
# # 하루에 한 사람이 한 명씩 감염시키는 것으로 나타남
# # 확진자 한 사람이 나올 경우 30일 이후에 몇 명의 감염자가 나오는지 계산하세요.

# man = 2
# date = 4
# total = man ** date
# print(f'{date} 일 이후 예상 감염자 수: {total}') 

