# 수학시험 프로그램

'''
다음은 수학시험 문제 및 정답입니다.
튜플에 문제를 저장하고 사용자가 답을 입력하면 채점하는 프로그램
--------------------------------------------------
 번호     문제               정답          점수     
--------------------------------------------------
 1번     3 + 2                5            3 점
 2번    5 /2 의 몫            2            5 점
 3번    10 - 2                8            3 점
 4번    100 * 2              200           5 점 
 5번 1-(10 / 4 의 나머지)     -1           5 점
 6번    2의 4제곱             16           3 점
 7번     4 / 2                2            3 점
--------------------------------------------------
'''

# Quiz = (
#     ['3 + 2', 5, 3],
#     ['5 / 2', 2, 5],
#     ['10 - 2', 8, 3],
#     ['100 * 2', 200, 5],
#     ['1-(10 / 4 의 나머지)', -1, 5],
#     ['2의 4제곱 ', 16, 3],
#     ['4 / 2 ', 2, 3]
# )
# answerCount = 0
# totalScore = 0
# wrongCount = 0
# for item in Quiz:
#     print(f'문제: {item[0]}')
#     answer = int(input('정답:'))
#     if answer == item[1]:
#         answerCount += 1 
#         totalScore += item[2]
#     else:
#         wrongCount += 1    
# print('-' * 25)
# print(f'맞춘개수: {answerCount}')
# print(f'틀린개수: {wrongCount}')
# print(f'총점: {totalScore}')
# print('-' * 25)





























































































































