# alphabet = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
# print(f'{alphabet[-4:-1]}')         # ['g', 'h', 'i']
# print(alphabet [-4:-1])             # ['g', 'h', 'i']
# print(alphabet [-3:-6])                      # []  앞보다 뒤가 작아선 안됨
# print(alphabet [-2:-2])                      # []   앞보다 뒤가 작아선 안됨
# print(f'{alphabet[len(alphabet)-4:-1]}')
# print(f'{alphabet[6:2]}')

'''
1.숫자 5개를 리스트에 저장한 뒤 가장 큰 숫자 출력하기
 [3, 7, 1, 9, 5]

2. 사용자에게 숫자 입력받아서
1부터 입력한 숫자까지 합계 출력하기 ( 5 )



3. 리스트에 있는 숫자 중 짝수만 출력하기
 [1,2,3,4,5,6]

4. 리스트 숫자를 오름차순 정렬하기
[5,1,7,3]
5. 리스트 숫자를 내림차순 정렬하기
 [5,1,7,3]

6. 리스트 안 숫자의 평균 구하기 [10,20,30]

7. 리스트에서 가장 작은 숫자 찾기
 (min() 사용 금지)

8. 1부터 100까지 숫자 중
3의 배수와 5의 배수 출력하기

9. 사용자가 입력한 숫자를 리스트에 저장하다가
0 입력하면 종료 후 리스트 출력하기
[입력: 3 ,입력: 7, 입력: 2 ,입력: 0]
'''




















































