# = 할당연산자

# = : 오른쪽의 값을 왼쪽의 변수에 할당한다.
# e에제) a=10 : 10이라는 값을 a라는 변수에 할당한다.


# + 덧셈연산자

# + : 두 피연산자의 합을 구한다.
# 예제) a=10, b=20 : a+b는 30이 된다.

# quiz) 총 매출액을 구하세요.
# sales1 = int(input('첫 번째 매출액을 입력하세요: '))
# sales2 = int(input('두 번째 매출액을 입력하세요: '))
# total =  sales1 + sales2
# print('총 매출액은', f'{total:,}원', '입니다.')


# - 뺄셈연산자

# - : 두 피연산자의 차를 구한다.
# 예제) a=10, b=20 : a-b는 -10이 된다.

# 예제문)
# print(10-5)
# print(3.14-0.1)
# quiz) 순수익(매출액 - 매입액)을 구하세요.
# sales = input('매출액을 입력하세요.')    # 판매비용
# cost = input('매입액을 입력하세요.')     # 구매비용
# profit = int(sales) - int(cost)       # 순 수익 계산

# print(f' 순 수익은 {profit:,} 원 입니다.')


# * 곱셈연산자

# * : 두 피연산자의 곱을 구한다.
# 예제) a=10, b=20 : a*b는 200이 된다.

# 예제문)
# print(10*5)
# print(3.14*2)

# # quiz) 방의 넓이를 계산하세요
# width = input('방의 가로 길이를 입력하세요')       # 방의 가로 길이
# height = input('방의 세로 길이를 입력하세요')      # 방의 세로 길이
# area = int(width) * int(height)                # 방의 넓이 계산
# print(f'방의 총 넓이는 {area:,} 제곱미터입니다.')

# quiz 2) 문자열을 사용자가 입력한 횟수만큼 출력하는 프로그램
# text = input('출력할 문구르 입력하세요')           # 출력할 문구
# count = input('출력할 횟수를 입력하세요')          # 출력할 횟수
# print(text * int(count))                        # 입력한 횟수만큼 문구를 출력함


# / 나눗셈연산자

# / : 두 피연산자의 몫을 구한다.
# 예제) a=10, b=20 : a/b는 0.5가 된다.

